In [2]:
import pandas as pd
import numpy as np

In [4]:
data = {'2020':[1234567,4568912,7589642,9348762],'2010':[10312546,4721354,8752256,9875315]}
df = pd.DataFrame(data, index = ['서울','부산','인천','광주'])
df

      2020      2010
0  1234567  10312546
1  4568912   4721354
2  7589642   8752256
3  9348762   9875315

In [8]:
df.index = ['서울','부산','인천','광주']
df

       2020      2010
서울  1234567  10312546
부산  4568912   4721354
인천  7589642   8752256
광주  9348762   9875315

In [11]:
data = {'2020':[1234567,4568912,7589642,9348762],'2010':[10312546,4721354,8752256,9875315]}
df = pd.DataFrame(data, index = ['서울','부산','인천','광주'])
df
# dataframe은 column으로 값들을 불러올 수 있다

       2020      2010
서울  1234567  10312546
부산  4568912   4721354
인천  7589642   8752256
광주  9348762   9875315

In [21]:
df['2020']

서울    1234567
부산    4568912
인천    7589642
광주    9348762
Name: 2020, dtype: int64

In [24]:
data = [[9234567,4568912,7589642,9348762],[10312546,4721354,8752256,9875315]]
ind = ['2010','2020']
col = ['서울','부산','인천','광주']
df2 = pd.DataFrame(data, index = ind, columns = col)
df2

            서울       부산       인천       광주
2010   9234567  4568912  7589642  9348762
2020  10312546  4721354  8752256  9875315

In [25]:
df2['서울']

2010     9234567
2020    10312546
Name: 서울, dtype: int64

In [35]:
# 행과 열을 변경
df2 = df2.T
df2

       2010      2020
서울  9234567  10312546
부산  4568912   4721354
인천  7589642   8752256
광주  9348762   9875315

In [36]:
df2.values, df2.index, df2.columns

(array([[ 9234567, 10312546],
        [ 4568912,  4721354],
        [ 7589642,  8752256],
        [ 9348762,  9875315]], dtype=int64),
 Index(['서울', '부산', '인천', '광주'], dtype='object'),
 Index(['2010', '2020'], dtype='object'))

In [37]:
df2['2020']

서울    10312546
부산     4721354
인천     8752256
광주     9875315
Name: 2020, dtype: int64

In [50]:
df2 = df2[['2020','2010']]
df2

        2020     2010
서울  10312546  9234567
부산   4721354  4568912
인천   8752256  7589642
광주   9875315  9348762

In [57]:
df2['2005'] = [9762546,3512547,2517680,1456016]
df2

        2020     2010     2005
서울  10312546  9234567  9762546
부산   4721354  4568912  3512547
인천   8752256  7589642  2517680
광주   9875315  9348762  1456016

In [59]:
df2[:2]

        2020     2010     2005
서울  10312546  9234567  9762546
부산   4721354  4568912  3512547

#### loc, iloc
    loc : 인덱스 이름, column이름을 사용해서 값을 가져올 때 
    iloc : 인덱스 번호를 사용해서 값을 가져올 때

In [72]:
df2.loc['부산':'인천','2020':'2010']

       2020     2010
부산  4721354  4568912
인천  8752256  7589642

In [73]:
df2.iloc[1:3,:2]

       2020     2010
부산  4721354  4568912
인천  8752256  7589642